<script>
  import Bubble from "./Bubble.svelte";

  let messages = [
    {
      text: "У даному сценарії, Ви можете перейти до сценарію форми, заповнити форму, відповівши на запитання, та отримати сформовані дані в адмін-панелі.",
      type: "text",
      from: "bot",
    },
    { text: "🏠 Головне меню", type: "text", from: "user" },
    {
      text: "Привітальний сценарій конструктора чат-ботів Gerabot.У даному сценарії, Ви можете побачити можливості конструктора, пройшовши за різними кнопками.",
      type: "text",
      from: "bot",
    },
  ];
</script>

<div class="bubbles">
  {#each messages as message}
    <Bubble {message} />
  {/each}
</div>

<style>
  .bubbles {
    display: flex;
    flex-direction: column;
    padding: 12px;
  }
</style>
